#define LOG_TAG "EventReplayer"

#define LOG_NDEBUG 0

#define LOG_OVERHEAD 0

#include "JNIHelp.h"
#include "jni.h"
#include <utils/Log.h>
#include <utils/misc.h>
#include <android_runtime/AndroidRuntime.h>
#include <android_runtime/Log.h>

#include "android_runtime/AndroidRuntime.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <sys/ioctl.h>
#include <dirent.h>
#include <fcntl.h>
#include <errno.h>
#include <unistd.h>
#include <time.h>
#include <pthread.h>

struct input_event {
	struct timeval time;
	unsigned short type;
	unsigned short code;
	unsigned long value;
};

// from <linux/input.h>
#define EVIOCGVERSION		_IOR('E', 0x01, int)			/* get driver version */
#define EVIOCGID		_IOR('E', 0x02, struct input_id)	/* get device ID */
#define EVIOCGKEYCODE		_IOR('E', 0x04, int[2])			/* get keycode */
#define EVIOCSKEYCODE		_IOW('E', 0x04, int[2])			/* set keycode */

#define EVIOCGNAME(len)		_IOC(_IOC_READ, 'E', 0x06, len)		/* get device name */
#define EVIOCGPHYS(len)		_IOC(_IOC_READ, 'E', 0x07, len)		/* get physical location */
#define EVIOCGUNIQ(len)		_IOC(_IOC_READ, 'E', 0x08, len)		/* get unique identifier */

#define EVIOCGKEY(len)		_IOC(_IOC_READ, 'E', 0x18, len)		/* get global keystate */
#define EVIOCGLED(len)		_IOC(_IOC_READ, 'E', 0x19, len)		/* get all LEDs */
#define EVIOCGSND(len)		_IOC(_IOC_READ, 'E', 0x1a, len)		/* get all sounds status */
#define EVIOCGSW(len)		_IOC(_IOC_READ, 'E', 0x1b, len)		/* get all switch states */

#define EVIOCGBIT(ev,len)	_IOC(_IOC_READ, 'E', 0x20 + ev, len)	/* get event bits */
#define EVIOCGABS(abs)		_IOR('E', 0x40 + abs, struct input_absinfo)		/* get abs value/limits */
#define EVIOCSABS(abs)		_IOW('E', 0xc0 + abs, struct input_absinfo)		/* set abs value/limits */

#define EVIOCSFF		_IOC(_IOC_WRITE, 'E', 0x80, sizeof(struct ff_effect))	/* send a force effect to a force feedback device */
#define EVIOCRMFF		_IOW('E', 0x81, int)			/* Erase a force effect */
#define EVIOCGEFFECTS		_IOR('E', 0x84, int)			/* Report number of effects playable at the same time */

#define EVIOCGRAB		_IOW('E', 0x90, int)			/* Grab/Release device */
// end <linux/input.h>

#define ARRAYSIZE(x)  (sizeof(x)/sizeof(*(x)))


struct kernel_input_event {
	long deviceNum;					// 4B
	long typeVal;					// 4B
	long codeVal;					// 4B
	long value;						// 4B
	// 16B per an event
};
struct platform_event {
	long peType;					// 4B
	long response_time_us;			// 4B
	long priv;						// 4B
	long second_priv;			// 4B
	// 16B per an event
};

struct replay_buffer_tuple {
	long long timestamp;	// 8B
	long eventType;			// 4B
	union {
		struct kernel_input_event ke;
		struct platform_event pe;
	} prv;				// 16B
	// 28B per a tuple
};

struct replay_buffer {
	long long sn;
	int size;
	int cursor;
	pthread_mutex_t lock;
	struct replay_buffer_tuple* fixed_tuples;	// fixed size
	struct replay_buffer_tuple* extra_tuples;	// flexible size, chunk by chunk.
};

struct response_buffer_tuple {
	long long deadline;	// 8B
	union {
		struct platform_event pe;
	} prv;				// 16B
	// 24B per a tuple
};

static const int RESPONSE_BUFFER_SIZE = 100;
struct response_buffer {
	int read_cursor;
	int write_cursor;
	pthread_mutex_t lock;
	struct response_buffer_tuple tuples[RESPONSE_BUFFER_SIZE];	// circular queue buffer
};

struct commands_flag {
	bool skip_waiting_in_replay;
	pthread_mutex_t lock;
};

static jmethodID method_didUpdateReplayingFields;
static jmethodID method_doLongSleepMS;

// Replayer's state
static const int RP_STATE_IDLE = 0;
static const int RP_STATE_READY_TO_FIRST_FETCHING = 1;
static const int RP_STATE_INITIAL_FETCHING = 2;
static const int RP_STATE_INITIAL_AND_FINAL_FETCHING = 3;
static const int RP_STATE_REPLAYING_AND_FETCHING = 4;
static const int RP_STATE_FINAL_FETCHING = 5;
static const int RP_STATE_ALL_FETCHED = 6;
static int gReplayerState = RP_STATE_IDLE;
static bool gIsThreadAlive = false;

// Global attributes
